# 단순 조건문===================================================
# True인 경우에만 처리하는 조건문
# if 조건:
#    실행코드
# ============================================================

# 단순 조건문===================================================
# True/False 다르게 처리하는 조건문
# if 조건:
#    실행코드(T)
#else:
#    실행코드(F)
# ============================================================

# 다중 조건문===================================================
# 조건이 4개인 경우
# if 조건:
#    실행코드
# elif 조건2:
#    실행코드0
# elif 조건3:
#    실행코드
# else:
#    실행코드
# ============================================================


#조건부 표현식
#조건 True 실행코드 if 조건식 else 조건 false 실행코드

#홀짝 식별 후 결과 출력

num = 27
if num%2:
    print(f"{num}:홀수")

else:
    print(f'{num}: 짝수')



#--->

print(f'{num}:홀수') if num%2 else print(f'{num}: 짝수')


#양수, 0, 음수 식별 후 출력

if num>0:
    print(f'{num}: 양수')
elif num<0:
    print(f'{num}: 음수')
else:
    print('0')

result = "양수" if num>0 else "음수" if num<0 else "0"

print(num, result)